config/etc/init-term.org
* init-term.el
:PROPERTIES:
:HEADER-ARGS: :tangle (concat temporary-file-directory "init-term.el") :lexical t
:END:

** Headers
#+begin_src emacs-lisp
  ;;; init-term.el ---   -*- lexical-binding: t; -*-

  ;;; Commentary:

  ;;; Code :
  #+end_src

** Vterm
#+begin_src emacs-lisp
  (use-package vterm
    :ensure t
    :commands vterm-mode
    :config
    (setq vterm-max-scrollback 50000)
    (setq vterm-kill-buffer-on-exit t)
    (defun leesin/vterm-mode-hook()
      ;;Don't prompt about dying processes when killing vterm
      (setq confirm-kill-processes nil)
      ;;Prevent premature horizontal scrolling
      (setq hscroll-margin 0)
      )
    :hook (vterm-mode . leesin/vterm-mode-hook)
    )
#+end_src

** Vterm toggle
#+begin_src emacs-lisp
  (use-package vterm-toggle
    :ensure t
    :commands (vterm-toggle vterm-toggle-cd)
    :config
    (setq vterm-toggle-popup-dedicated-frame nil)
    )
#+end_src
** Ends
#+begin_src emacs-lisp
  (provide 'init-term)
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; init-term.el ends here
  #+end_src

